import { Testimonial } from '@/types';

export const patientTestimonials: Testimonial[] = [
  {
    id: 'test-1',
    name: 'م. حسين الحميدي',
    location: 'السعودية - الطائف',
    rating: 5,
    comment:
      'السلام عليكم ، الله يرضى على الدكتور عبدالله السواط ، ربحني من معاناة الناسور ، كانت معاناة يومية متعبة ،  عملية سريعة تقريبا مدة ٤٥ دقيقة تخدير نصفي ، رحت الصباح وبعد الظهر وانا في بيتي العجيب بعد العملية ، كانت الالام مدة يومين أو ثلاثة فقط ، ووقت الاخراج ، الحمدلله اني تجنبت تقنية الخيط المؤلمة ، والجرح إلتأم خلال ٥ اسابيع رجعت طبيعي ، كل الشكر للدكتور',
    procedure: 'علاج الناسور بالليزر',
    date: 'قبل شهرين',
  },
  {
    id: 'test-2',
    name: 'الأستاذ عبد الله العتياني',
    location: 'السعودية - جدة',
    rating: 5,
    comment:
      'في الحقيقة طلعت العملية ابسط مما توقعت الحمدلله والفضل يعود بعد الله للدكتور عبدالله ، شخص فاهم ومتمكن ويجيد التشخيص جيداً لاني قبله تعبت مع اكثر من دكتور ما عرفوا يشخصوني زين امام الدكتور عبدالله من اول جلسة شخصني وبدون يحتاج اشعة ما شاء الله عليه.. الله يبارك فيه وينفع به ويجزاه خير',
    procedure: 'جراحة استئصال القولون بالمنظار',
    date: 'قبل 3 أشهر',
  },
  {
    id: 'test-3',
    name: 'أبو نغم',
    location: 'السعودية - الطائف',
    rating: 5,
    comment:
      'الدكتور عبدالله من أفضل الأطباء خُلُقًا وعلمًا، ومتميّز جدًا في تخصصه. كانت تجربتي معه – بفضل الله – ناجحة بكل المقاييس. أجريت عنده عملية، وكانت النتيجة طيبة ومرضية جدًا ولله الحمد. تعاملُه راقٍ، واهتمامه بالمريض واضح، وحرصه على الشرح والطمأنة قبل وبعد العملية يعكس أمانته ومهنيته العالية. مهما كتبت فلن أوفيه حقه، فجزاه الله خير الجزاء، وبارك في علمه وعمله.',
    procedure: 'علاج الشرخ الشرجي',
    date: 'قبل شهر',
  },
  {
    id: 'test-4',
    name: 'المهندس مجيد',
    location: 'السعودية - مكة المكرمة',
    rating: 5,
    comment:
      'السلام عليكم ورحمة الله وبركاته مساء الخير دكتورنا الفاضل، أحب أشكرك من قلبي على العملية وعلى اهتمامك وتعبك معي. الله يجزاك خير ويكتب أجرك ويجعل ما قدمته في ميزان حسناتك. بصراحة لمست منك أخلاق عالية وحرص على المريض، وهذا شيء نفتخر فيه. أسأل الله يبارك في علمك وعملك ويجعلك سبب في شفاء الكثير من الناس. شكراً لك من القلب.',
    procedure: 'استشارة وجراحة بواسير بالليزر',
    date: 'قبل 4 أشهر',
  },
  {
    id: 'test-5',
    name: 'السيدة سميرة',
    location: 'السعودية - الطائف',
    rating: 5,
    comment:
      'ايستطيع اللسان عن التعبير عن مدى شكري و امتناني لك، فكنت خير مثال في الكفاءة الطبية الممزوجة بالرعاية و الاهتمام شكرا لك، لن تفيكم كلمات الشكر حقكم فقد كنت نعم السند ونعم الطبيب وطاقم الطبيى حفظكم اللّٰه و رعاكم و وفقكم في مهنتكم النبيلة. مع فائق احترامى وتقديرى',
    procedure: 'فحص ومتابعة القولون',
    date: 'قبل أسابيع',
  },
  {
    id: 'test-6',
    name: 'م. عبد العزيز الفهد',
    location: 'السعودية - الطائف',
    rating: 5,
    comment:
      'الدكتور عبدالله الدكتور الأول والأفضل والمتميز في جراحة أمراض القولون والمستقيم اشكر الدكتور عبدالله لتعامله الراقي ولتعاونه مع جميع الحالات ولحرصه واهتمامه على خصوصية المريض وسلامته فاسأل الله أن يكتب أجره وثوابه وأن يعينه ويوفقه لكل خير وصلاح أتمنى له دوام النجاح والتوفيق 🤍 …',
    procedure: 'فحص ومتابعة القولون',
    date: 'قبل أسابيع',
  },
  {
    id: 'test-7',
    name: 'الأستاذ مهند',
    location: 'السعودية - جدة',
    rating: 5,
    comment:
      'الله يجعل يدينه ماتمسها النار رجل اديب محترم خلوق هو والي معاه والله اني ندمان ماجيته من بدايه ماتعبت صادق في كلامه مع المريض ومتجاوب ويخليك تطلع من عنده متفائل ونفسيتك كويسه الف الف شكر يادكتور عبدالله السواط',
    procedure: 'فحص ومتابعة القولون',
    date: 'قبل أسابيع',
  },
  {
    id: 'test-8',
    name: 'الشيخ نايف بن حميد',
    location: 'السعودية - مكة',
    rating: 5,
    comment:
      'أجريتُ لابني عملية ناسور لدى الدكتور عبد الله الصواط، وكانت تجربة مطمئنة من حيث التشخيص والإجراء والمتابعة. يتمتع بتمكّن علمي ودقة جراحية عالية، مع أسلوب تواصلي هادئ وواضح يعكس خبرة حقيقية. وجود كفاءة طبية بهذا المستوى يُعد قيمة مضافة نفتخر بها. أسأل الله أن يبارك في علمه وعمله وأن يجعل ما يقدمه من جهد وعناية بالمرضى في ميزان حسناته.',
    procedure: 'فحص ومتابعة القولون',
    date: 'قبل أسابيع',
  },
];
